linear.measurement.mongo.update.original.v.1.26/mongo.op_update.threads_20.mes_7.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=15585 -threads 20 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 398
[OVERALL], Throughput(ops/sec), 2512.5628140703516
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.507537688442211
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 1.507537688442211
[READ], Operations, 499
[READ], AverageLatency(us), 3870.0901803607217
[READ], MinLatency(us), 253
[READ], MaxLatency(us), 51263
[READ], 95thPercentileLatency(us), 9007
[READ], 99thPercentileLatency(us), 49855
[READ], Return=OK, 499
[CLEANUP], Operations, 20
[CLEANUP], AverageLatency(us), 293.6
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 5799
[CLEANUP], 95thPercentileLatency(us), 74
[CLEANUP], 99thPercentileLatency(us), 5799
[UPDATE], Operations, 501
[UPDATE], AverageLatency(us), 1579.9680638722555
[UPDATE], MinLatency(us), 110
[UPDATE], MaxLatency(us), 50495
[UPDATE], 95thPercentileLatency(us), 3643
[UPDATE], 99thPercentileLatency(us), 49567
[UPDATE], Return=OK, 501